soma_copyfile.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
<dp:request xmlns:dp="http://www.datapower.com/schemas/management">
<dp:set-file name="local:///KanchanTestfile">
abcd
</dp:set-file>
</dp:request>
</soapenv:Body>
</soapenv:Envelope>
